app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    # @cat = current_user.cats.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = 1  [["description", "Don't eat"], ["updated_at", "2015-07-15 21:16:57.826429"]]