app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY start_date  [["cat_id", 1]]
---
  </tr>
  <% requests_with_requesters = @cat.rental_requests.includes(:requester) %>